{
    "architectures": [
        "Qwen2_5_VLForConditionalGeneration"
    ],
    "attention_dropout": 0.0,
    "torch_dtype": "bfloat16",
    "eos_token_id": 151645,
    "hidden_act": "silu",
    "hidden_size": 3584,
    "initializer_range": 0.02,
    "intermediate_size": 18944,
    "max_position_embeddings": 32768,
    "max_window_layers": 28,
    "model_name": "/workspace/FLS-Training/memory/model_checkpoints/20260407_1601_unsloth/merged_16bit",
    "model_type": "qwen2_5_vl",
    "num_attention_heads": 28,
    "num_hidden_layers": 28,
    "num_key_value_heads": 4,
    "pad_token_id": 151654,
    "rms_norm_eps": 1e-06,
    "rope_scaling": {
        "mrope_section": [
            16,
            24,
            24
        ],
        "rope_type": "default",
        "type": "default"
    },
    "rope_theta": 1000000.0,
    "sliding_window": 32768,
    "text_config": {
        "architectures": [
            "Qwen2_5_VLForConditionalGeneration"
        ],
        "attention_dropout": 0.0,
        "torch_dtype": "bfloat16",
        "eos_token_id": 151645,
        "hidden_act": "silu",
        "hidden_size": 3584,
        "image_token_id": 151655,
        "initializer_range": 0.02,
        "intermediate_size": 18944,
        "layer_types": [
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention",
            "full_attention"
        ],
        "max_position_embeddings": 128000,
        "max_window_layers": 28,
        "model_type": "qwen2_5_vl_text",
        "num_attention_heads": 28,
        "num_hidden_layers": 28,
        "num_key_value_heads": 4,
        "pad_token_id": 151654,
        "rms_norm_eps": 1e-06,
        "rope_scaling": {
            "mrope_section": [
                16,
                24,
                24
            ],
            "rope_type": "default",
            "type": "default"
        },
        "rope_theta": 1000000.0,
        "sliding_window": null,
        "use_cache": true,
        "use_sliding_window": false,
        "video_token_id": 151656,
        "vision_end_token_id": 151653,
        "vision_start_token_id": 151652,
        "vision_token_id": 151654,
        "vocab_size": 152064
    },
    "tie_word_embeddings": false,
    "unsloth_fixed": true,
    "unsloth_version": "2026.4.4",
    "use_cache": true,
    "use_sliding_window": false,
    "vision_config": {
        "depth": 32,
        "torch_dtype": "bfloat16",
        "fullatt_block_indexes": [
            7,
            15,
            23,
            31
        ],
        "hidden_act": "silu",
        "hidden_size": 1280,
        "in_channels": 3,
        "in_chans": 3,
        "initializer_range": 0.02,
        "intermediate_size": 3420,
        "model_type": "qwen2_5_vl",
        "num_heads": 16,
        "out_hidden_size": 3584,
        "patch_size": 14,
        "spatial_merge_size": 2,
        "spatial_patch_size": 14,
        "temporal_patch_size": 2,
        "tokens_per_second": 2,
        "window_size": 112
    },
    "vision_token_id": 151654,
    "vocab_size": 152064
}